Program received signal SIGHUP, Hangup.
 gcc -g p7original.c
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main 
Breakpoint 1 at 0x722: file p7original.c, line 17.
(gdb) r
Starting program: /home/runner/pps-IA1-practice/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p7original.c:17
17      c1 = input();
(gdb) n
Enter the Real part: 12
Enter the Imaginary part : 23
18      c2 = input();
(gdb) n
Enter the Real part: 32
Enter the Imaginary part : 43
20      sum = add(c1, c2);
(gdb) s
add (a=..., b=...) at p7original.c:39
39      sum.real = a.real + b.real;
(gdb) n
40      sum.imaginary = a.imaginary + b.imaginary;
(gdb) n
41      return sum;
(gdb) n
42  }
(gdb) n
main () at p7original.c:21
21      output(c1, c2, sum);
(gdb) s
output (a=..., b=..., sum=...) at p7original.c:46
46      printf("\n1st complex number = %0.1f + %0.1fi\n",a.real, a.imaginary);
(gdb) n

1st complex number = 12.0 + 23.0i
47      printf("2nd complex number = %0.1f + %0.1fi\n",b.real, b.imaginary);
(gdb) c
Continuing.
2nd complex number = 32.0 + 43.0i

Sum of 12.0 + 23.0i and 32.0 + 43.0i = 
 44.0 + 66.0i
[Inferior 1 (process 262) exited normally]
(gdb) q